[
  {
    "id": 1,
    "title": "Compose article",
    "subtitle": "This page represents a compose article and you will learn how to make such screen using Jetpack compose.",
    "description": "Jetpack Compose is a modern toolkit for building native Android UI. Compose simplifies and accelerates UI development on Android with less code, powerful tools, and intuitive Kotlin APIs. In this comprehensive guide, you will learn how to structure an article page using Compose's declarative approach to UI. You'll start by understanding the fundamental building blocks of Compose including composable functions, modifiers, and state management. The tutorial walks you through creating reusable components for headers, body text, and images that form the foundation of any article page. You'll explore typography styling using Material Design principles to ensure readability and visual appeal. Advanced topics include implementing scrolling behavior, handling different screen sizes through responsive design, and adding interactive elements like expandable sections. By the end of this tutorial, you'll have a solid understanding of how to implement content-rich screens in your Android applications using Jetpack Compose's powerful composition model. You'll also learn performance optimization techniques to ensure smooth scrolling and rendering even with complex article layouts and rich media content.",
    "imageUrl": "https://developers.google.com/static/profile/badges/playlists/android/android-basics-compose-unit-1-pathway-1/badge.svg",
    "web_url": "",
    "publishedDate": "Published · Oct, 28 2025",
    "author": "John Doe"
  },
  {
    "id": 2,
    "title": "Quadrant",
    "subtitle": "In this section, you will discover how to use composition effectively.",
    "description": "Displays text and follows the recommended Material Design guidelines. This tutorial explores the concept of quadrants in Jetpack Compose, a powerful way to organize UI elements in a grid-like structure. You'll learn how to divide the screen into four equal sections and populate each with different content while maintaining visual harmony. The guide begins with setting up a basic Compose project and walks you through implementing custom layouts using Row and Column composables with weight modifiers. You'll explore how to apply different background colors to each quadrant while ensuring proper spacing and alignment between elements. The tutorial also covers accessibility considerations, making sure your quadrant-based layouts work well with screen readers and other assistive technologies. You'll learn techniques for handling different screen orientations and sizes, ensuring your quadrant layout adapts gracefully to various devices. By completing this project, you'll gain valuable insights into Compose's layout system and develop skills for creating more complex UI arrangements in your future Android applications.",
    "imageUrl": "https://cdn-icons-png.flaticon.com/512/6699/6699786.png",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-composables-practice-problems?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-1-pathway-3%3F_gl%3D1*e6jqmv*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-composables-practice-problems&_gl=1*e6jqmv*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#0",
    "publishedDate": "Published · Feb, 05 2024",
    "author": "Michael Smith"
  },
  {
    "id": 3,
    "title": "Tip Calculator",
    "subtitle": "In this code lab you will learn how to build a tip calculator app.",
    "description": "This comprehensive tutorial guides you through building a fully functional tip calculator application using Jetpack Compose. You'll start by designing an intuitive user interface that allows users to enter bill amounts, select tip percentages, and split bills among multiple people. The project emphasizes state management in Compose, teaching you how to track and update values as users interact with various input fields. You'll implement custom text fields with input validation to ensure proper numerical entry and learn to handle keyboard events for a smooth user experience. The tutorial covers implementing mathematical operations to calculate tips accurately and format currency values according to the user's locale. You'll also explore creating custom UI components like a percentage selector and a person counter with increment/decrement buttons. Advanced topics include saving calculation history using Room database, implementing themes that respond to system dark mode, and adding animations to provide visual feedback during user interactions. By the end of this project, you'll have gained practical experience with form handling, state management, and mathematical operations in Jetpack Compose applications.",
    "imageUrl": "https://play-lh.googleusercontent.com/kNODo_-kWzlmyLmEMiBJqdk4kYiMkZVxsYhZW04Z_F_PX1oIPLzW-PEaihRh3xOblig",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-using-state?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-2-pathway-3%3F_gl%3D1*o47wws*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-using-state&_gl=1*o47wws*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#0",
    "publishedDate": "Published · Jan, 28 2024",
    "author": "Qasim Alex"
  },
  {
    "id": 4,
    "title": "Art Space App",
    "subtitle": "In this section you will learn how to build an art space app.",
    "description": "The Art Space App tutorial provides a comprehensive guide to building a digital art gallery application using Jetpack Compose. This project will teach you how to create an interactive interface that displays artwork images along with their titles, artists, and year information. You'll learn how to implement navigation controls that allow users to browse through the collection of artworks with previous and next buttons. The tutorial covers important UI concepts like creating frames around images, applying shadows and borders to enhance visual appeal, and implementing proper spacing between elements. You'll explore state management techniques to track the currently displayed artwork and update the UI accordingly when navigation events occur. The guide also demonstrates how to handle edge cases such as reaching the beginning or end of the collection. Advanced topics include implementing smooth transitions between artworks using Compose animations, adding zoom functionality for detailed art viewing, and creating a grid view alternative for browsing the collection. By completing this project, you'll develop skills in working with images, creating custom UI components, and managing application state in Jetpack Compose.",
    "imageUrl": "https://developers.google.com/static/profile/badges/playlists/android/android-basics-compose-unit-2-pathway-3/badge.svg",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-build-a-dice-roller-app?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-2-pathway-2%3F_gl%3D1*1fdjrz6*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-build-a-dice-roller-app&_gl=1*o47wws*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#8",
    "publishedDate": "Published · Apr, 01 2024",
    "author": "Lisa Johnson"
  },
  {
    "id": 5,
    "title": "Lemonade",
    "subtitle": "This section will teach how to make a thirst quencher lemonade.",
    "description": "The Lemonade app tutorial offers a delightful introduction to interactive Android applications using Jetpack Compose. In this project, you'll build a simple but engaging app that simulates the process of making lemonade through a series of interactive steps. You'll learn how to implement state management to track the user's progress through the lemonade-making process: picking a lemon, squeezing it, drinking the lemonade, and starting over. The tutorial covers creating interactive composables that respond to user taps and change both visuals and text based on the current state. You'll implement custom animations to make transitions between states more engaging and provide visual feedback for user interactions. The guide demonstrates how to organize your code using Compose best practices, separating UI elements from business logic for better maintainability. You'll also learn to use resource files effectively for strings and images, making your app easier to localize and modify. Additional topics include adding sound effects to enhance the interactive experience, implementing haptic feedback for a more immersive feel, and creating custom vector animations for the lemon-squeezing action. This project provides a solid foundation in building state-driven interactive applications with Jetpack Compose.",
    "imageUrl": "https://cdn-icons-png.flaticon.com/512/1425/1425548.png",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-button-click-practice-problem?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-2-pathway-2%3F_gl%3D1*1fdjrz6*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-button-click-practice-problem&_gl=1*1fdjrz6*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#0",
    "publishedDate": "Published · Sep, 15 2023",
    "author": "Sarah Williams"
  },
  {
    "id": 6,
    "title": "Task Manager",
    "subtitle": "This section will teach you task manager.",
    "description": "The Task Manager tutorial provides a comprehensive guide to building a productivity application using Jetpack Compose and modern Android architecture components. This project will teach you how to create a fully functional task management system where users can add, edit, delete, and organize their daily tasks. You'll learn how to implement a clean architecture pattern with separation of concerns between UI, domain logic, and data layers. The tutorial covers creating a responsive and intuitive user interface with custom task cards, priority indicators, due date displays, and completion checkboxes. You'll implement state management using ViewModel and StateFlow to ensure your app responds properly to user interactions and configuration changes. The guide demonstrates how to persist data using Room database, allowing tasks to be stored locally and retrieved when the app restarts. You'll explore advanced features like task categorization, sorting options, search functionality, and filtering tasks by status or priority. The project also covers implementing reminder notifications for upcoming tasks, adding drag-and-drop functionality for reordering tasks, and creating custom animations for task completion. By building this Task Manager app, you'll gain practical experience with CRUD operations, local data storage, and complex UI interactions in Jetpack Compose.",
    "imageUrl": "https://cdn-icons-png.flaticon.com/512/2387/2387635.png",
    "web_url": "",
    "publishedDate": "Published · Jul, 10 2023",
    "author": "David Brown"
  },
  {
    "id": 7,
    "title": "Art Space",
    "subtitle": "In this section you mainly going to study modifier of compose.",
    "description": "Prerequisites\nAbility to create and run a project in Android Studio.\nExperience with Kotlin syntax, which includes Boolean and when expressions.\nAbility to apply basic Jetpack Compose concepts, such as the use of state with MutableState object.\nExperience with composable functions, which includes Text, Image, and Button composables.\nWhat you'll learn\nHow to build low-fidelity prototypes and translate them to code.\nHow to build simple layouts with Row and Column composables, and arrange them with horizontalAlignment and verticalArrangement parameters.\nHow to customize Compose elements with a Modifier object.\nHow to identify states and modify them upon triggers, such as button taps.\nWhat you'll build\nAn Android app that can display artwork or family photos",
    "imageUrl": "https://developers.google.com/static/profile/badges/playlists/android/android-basics-compose-unit-2-pathway-3/badge.svg",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-art-space?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-2-pathway-3%3F_gl%3D1*o47wws*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-art-space&_gl=1*1gogme7*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#0",
    "publishedDate": "Published · Jun, 22 2023",
    "author": "Emily Davis"
  },
  {
    "id": 8,
    "title": "Business card",
    "subtitle": "By building business card app you will learn how to work with compose components.",
    "description": "You'll learn how to build simple layouts with Row and Column composables, and arrange them with horizontalAlignment and verticalArrangement parameters.\nHow to customize Compose elements with a Modifier object.",
    "imageUrl": "https://cdn-icons-png.flaticon.com/512/1570/1570813.png",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-business-card?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-1-pathway-3%3F_gl%3D1*e6jqmv*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-business-card&_gl=1*1pa7e09*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#0",
    "publishedDate": "Published · May, 18 2023",
    "author": "Daniel Wilson"
  },
  {
    "id": 9,
    "title": "In building process...",
    "subtitle": "In building process...",
    "description": "This upcoming tutorial will guide you through the process of creating a dynamic weather forecast application using Jetpack Compose and modern Android development practices. You'll learn how to design an intuitive interface that displays current weather conditions, daily forecasts, and hourly predictions with beautiful visualizations. The project will teach you how to integrate with weather APIs using Retrofit and handle network responses efficiently with Kotlin coroutines and Flow. You'll implement location services to automatically detect the user's position and provide relevant weather data for their area. The tutorial covers creating custom weather visualizations including animated precipitation indicators, temperature graphs, and wind direction displays. You'll learn strategies for caching weather data locally using Room database to provide offline functionality and reduce network requests. The guide demonstrates how to build widgets for home screen access and implement notifications for weather alerts and daily forecasts. Advanced topics include creating custom animations for weather transitions, implementing material design principles for different weather conditions, and adding user preferences for temperature units and location management. This comprehensive project will strengthen your skills in API integration, data visualization, and creating polished user experiences in Jetpack Compose applications.",
    "imageUrl": "https://cdn-icons-png.flaticon.com/512/4814/4814268.png",
    "web_url": "",
    "publishedDate": "Published · Apr, 30 2023",
    "author": "Olivia Taylor"
  },
  {
    "id": 10,
    "title": "Woof",
    "subtitle": "Woof is app about dogs.",
    "description": "In this code lab, you learn about Material Theming, which allows you to use Material Design in your app, with guidance on customizing colors, typography, and shapes. You can customize as little, or as much, as you like for your app. You also learn how to add a top app bar to display the app's name and icon.",
    "imageUrl": "https://static.vecteezy.com/system/resources/previews/016/461/327/non_2x/woof-text-in-a-speech-bubble-balloon-sticker-design-cartoon-comics-dog-bark-sound-effect-and-lettering-simple-flat-illustration-on-brown-background-vector.jpg",
    "web_url": "https://developer.android.com/codelabs/basic-android-kotlin-compose-material-theming?continue=https%3A%2F%2Fdeveloper.android.com%2Fcourses%2Fpathways%2Fandroid-basics-compose-unit-3-pathway-3%3F_gl%3D1*j7lcq0*_up*MQ..%26gclid%3DCj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB%26gclsrc%3Daw.ds%26gbraid%3D0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87%23codelab-https%3A%2F%2Fdeveloper.android.com%2Fcodelabs%2Fbasic-android-kotlin-compose-material-theming&_gl=1*j7lcq0*_up*MQ..&gclid=Cj0KCQjw5azABhD1ARIsAA0WFUHTKKU44sNJA4CJpMS8xqi1bIY-rNJC6bPC_YBYy43lGYLR_O-Go8waAhYiEALw_wcB&gclsrc=aw.ds&gbraid=0AAAAAC-IOZnwIECgKs6z9J8If8u8GFS87#0",
    "publishedDate": "Published · Mar, 25 2023",
    "author": "William Anderson"
  }
]